{
   "Robert Chang" :"Looking back at my own academic and professional career so far, many times in the past I self-censored my questions because I did not want to appear incapable. However, over time I realized that this attitude was rather detrimental — in the long run, most instances of self-censorship are missed opportunities for learning rather than shame.",
   
   "Claude Shannon's essay" : "There's the idea of dissatisfaction. By this I don't mean a pessimistic dissatisfaction of the world ; we don't like the way things are ;I mean a constructive dissatisfaction.\n\nThe idea could be expressed in the words, This is OK, but I think things could be done better. I think there is a neater way to do this. I think things could be improved a little. In other words, there is continually a slight irritation when things don't look quite right; and I think that dissatisfaction in present days is a key driving force in good scientists.",

   "Heraclitus" : "Change is constant." ,

   "Richard Hamming" : "If what you are doing is not important, not likely to be important, why are you doing it? You must work on important problems. I spent Friday afternoon for years thinking about the important problems in my field [that's 10% of my working time].\n\nLet me warn you about important problems, importance is not the consequence, some problems are not important because you haven't gotten an attack. The importance of problem, to a great extent, depends on if you got a way of attacking the problem.\n\nThis whole course, I am trying to teach you something about style and taste, so you'll be able to have some hunch on when the problem is right, what problem is right, how to go about it. The right problem at the right time at the right way counts, and nothing else counts. Nothing.",

   "Richard Feynman" : "Richard Feynman was once asked by a Caltech faculty member to explain why spin one-half particles obey Fermi Dirac statistics. Rising to the challenge, he said, “I'll prepare a freshman lecture on it.” But a few days later he told the faculty member, “You know, I couldn't do it. I couldn't reduce it to the freshman level. That means we really don't understand it."
}